<!DOCTYPE html>

<html lang="en-us">
<head>
    <meta charset="utf-8"/>
    <meta content="width=device-width, initial-scale=1" name="viewport"/>
    <title> Amar Ahmane &bull; Home </title>
    <link href="css/style.css" rel="stylesheet"/>
    <link href="css/fonts.css" rel="stylesheet"/>
</head>
<body>
    <nav>
        <ul class="menu">
            <li><a href="index.html">Home</a></li>
            <li><a href="rapports.html">Reports</a></li>
            <li><a href="ens.html">Teaching</a></li>
            <li><a href="tikz.html">PGF/TikZ figures</a></li>
        </ul>
        <hr/>
    </nav>
    <main>
        <header>
        </header>
        <article>
            <h2><em>Amar Ahmane, personal web page</em></h2>
            <figure class="description">
                <div class="aside">
                    <p>
                      I am currently a student at <a href="https://ens-paris-saclay.fr">ENS Paris-Saclay</a>, 
                      persuing a second year of masters in Mathematics (M2).
                      My academic interests primarily include Optimisation, Functional and Numerical Analysis and the study of SPDEs and SDEs.
                  </p>
                  <p>
                      As the title says, this is my personal web page. 
                      By browsing here, you'll be able to find some of my (at the time modest) work,
                      access my <a href="src/cv-amarahmane.pdf">resume</a>, and <a href="mailto:amar.ahmane@ens-paris-saclay.fr">contact me</a>
                      if you feel the need to. 
                  </p>
              </div>
              <img src="src/img/me.jpeg" width="65%"/>
          </figure>
          <h4>For CPGE students : kh&ocirc;lles de Math&eacute;matiques en MPI*</h4>
          <p>
            Tout au long de mon ann&eacute;e de math&eacute;matiques sp&eacute;ciales,
            j&rsquo;ai mis &agrave; jour un document compilant les exercices de kh&ocirc;lle donn&eacute;s &agrave; plusieurs &eacute;l&egrave;ves.
            Lorsque j&rsquo;en trouvais le temps, je tapais &eacute;galement des propositions de solutions pour certains exercices.
            Acc&eacute;dez &agrave; la compilation en cliquant <a href="src/colles/2023/colles2023.pdf">ici</a>.
        </p>
        <p>
            Noter que les solutions ne constituent que des propositions d&rsquo;approche &agrave; adopter pour r&eacute;soudre les exercices, et peuvent comporter des erreurs;
            si vous &ecirc;tes amen&eacute;s &agrave; en d&eacute;celer, n&rsquo;h&eacute;sitez pas &agrave; m&rsquo;en faire part en me contactant <a href="mailto:amar.ahmane@ens-paris-saclay.fr">par mail</a>.
        </p>
        <p>
            Pour plus d'exercices, il est possible de trouver une compilation d'exercices d'oral 
            pos&eacute;s aux &eacute;l&egrave;ves de MP* et MP** du Lyc&eacute;e Thiers (Marseille) <a href="https://perso.eleves.ens-rennes.fr/people/giovanni.lebaron/oraux_thiers.pdf">ici</a>.
            Le document est propos&eacute; par un ami de l'ENS Rennes (Giovanni Lebaron).
        </p>
    </article>
</main>
<footer>
    <p>Last updated on Tue 16 Dec 2025, 11:25:39. by <a href="https://github.com/PommeBleue/pommebleue.github.io/6a8cf0cc0e291f08708942424741e2e24bfe0884">6a8cf0cc0e29</a></p>
</footer>
</body>
</html>